---
type: FabricationDimensionDefinition
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# FabricationDimensionDefinition

`Autodesk.Revit.DB.FabricationDimensionDefinition` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsModifiable | 2016 | `public bool IsModifiable { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2016 | `public string Name { get ; }` |
| Property | Type | 2016 | `public FabricationDimensionType Type { get ; }` |
| Property | UnitType | 2016 | `public FabricationDimensionUnitType UnitType { get ; }` |